# 1. Importar librerías

In [34]:
import pandas as pd

# 2. Cargar datos

## 2.1. Importar datos

In [35]:
general_data = pd.read_csv('Datasets/general_data.csv')
emp_surv_data = pd.read_csv('Datasets/employee_survey_data.csv')
man_surv_data = pd.read_csv('Datasets/manager_survey_data.csv')
time_work = pd.read_csv('Datasets/time_work.csv', sep=';')

## 2.2. Unir tablas

In [36]:
employees = general_data.merge(emp_surv_data, how='outer', on='EmployeeID').merge(man_surv_data, how='outer', on='EmployeeID').merge(time_work, how='outer', on = 'EmployeeID')

In [37]:
employees.head()

,Age,Attrition,BusinessTravel,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeID,Gender,...,TrainingTimesLastYear,YearsAtCompany,YearsSinceLastPromotion,YearsWithCurrManager,EnvironmentSatisfaction,JobSatisfaction,WorkLifeBalance,JobInvolvement,PerformanceRating,mean_time
0,51,No,Travel_Rarely,Sales,6,2,Life Sciences,1,1,Female,...,6,1,0,0,3.0,4.0,2.0,3,3,"6,8702"
1,31,Yes,Travel_Frequently,Research & Development,10,1,Life Sciences,1,2,Female,...,3,5,1,4,3.0,2.0,4.0,2,4,"7,316"
2,32,No,Travel_Frequently,Research & Development,17,4,Other,1,3,Male,...,2,5,0,3,2.0,2.0,1.0,3,3,"6,8161"
3,38,No,Non-Travel,Research & Development,2,5,Life Sciences,1,4,Male,...,5,8,7,5,4.0,4.0,3.0,2,3,"6,7892"
4,32,No,Travel_Rarely,Research & Development,10,1,Medical,1,5,Male,...,2,6,0,4,4.0,1.0,3.0,3,3,"7,8776"

In [38]:
employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4410 entries, 0 to 4409
Data columns (total 30 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Age                      4410 non-null   int64
 1   Attrition                4410 non-null   object
 2   BusinessTravel           4410 non-null   object
 3   Department               4410 non-null   object
 4   DistanceFromHome         4410 non-null   int64
 5   Education                4410 non-null   int64
 6   EducationField           4410 non-null   object
 7   EmployeeCount            4410 non-null   int64
 8   EmployeeID               4410 non-null   int64
 9   Gender                   4410 non-null   object
 10  JobLevel                 4410 non-null   int64
 11  JobRole                  4410 non-null   object
 12  MaritalStatus            4410 non-null   object
 13  MonthlyIncome            4410 non-null   int64
 14  NumCompaniesWorked       4391 non-null   float64
 15  Over18                   4410 non-null   object
 16  PercentSalaryHike        4410 non-null   int64
 17  StandardHours            4410 non-null   int64
 18  StockOptionLevel         4410 non-null   int64
 19  TotalWorkingYears        4401 non-null   float64
 20  TrainingTimesLastYear    4410 non-null   int64
 21  YearsAtCompany           4410 non-null   int64
 22  YearsSinceLastPromotion  4410 non-null   int64
 23  YearsWithCurrManager     4410 non-null   int64
 24  EnvironmentSatisfaction  4385 non-null   float64
 25  JobSatisfaction          4390 non-null   float64
 26  WorkLifeBalance          4372 non-null   float64
 27  JobInvolvement           4410 non-null   int64
 28  PerformanceRating        4410 non-null   int64
 29  mean_time                4410 non-null   object
dtypes: float64(5), int64(16), object(9)
memory usage: 1.0+ MB

# 3. Transformar nombres de columnas

## 3.1. De PascalCase a snake_case

In [39]:
employees.columns = employees.columns.str.replace(r'(?<!^)(?=[A-Z])', '_', regex=True).str.lower()

In [40]:
employees.columns

Index(['age', 'attrition', 'business_travel', 'department',
       'distance_from_home', 'education', 'education_field', 'employee_count',
       'employee_i_d', 'gender', 'job_level', 'job_role', 'marital_status',
       'monthly_income', 'num_companies_worked', 'over18',
       'percent_salary_hike', 'standard_hours', 'stock_option_level',
       'total_working_years', 'training_times_last_year', 'years_at_company',
       'years_since_last_promotion', 'years_with_curr_manager',
       'environment_satisfaction', 'job_satisfaction', 'work_life_balance',
       'job_involvement', 'performance_rating', 'mean_time'],
      dtype='object')

In [41]:
employees.columns = employees.columns.str.replace('employee_i_d', 'employee_id')

## 3.2. Mover la columna employee_id a la primera posición

In [42]:
#Extraer columna employee_id
employee_id = employees.employee_id

#Eliminar columna employee_id
df_employees = employees.drop('employee_id', axis=1)

#Insertar columna employee_id en la primera posición
df_employees.insert(0, 'employee_id', employee_id)

In [43]:
df_employees.head()

,employee_id,age,attrition,business_travel,department,distance_from_home,education,education_field,employee_count,gender,...,training_times_last_year,years_at_company,years_since_last_promotion,years_with_curr_manager,environment_satisfaction,job_satisfaction,work_life_balance,job_involvement,performance_rating,mean_time
0,1,51,No,Travel_Rarely,Sales,6,2,Life Sciences,1,Female,...,6,1,0,0,3.0,4.0,2.0,3,3,"6,8702"
1,2,31,Yes,Travel_Frequently,Research & Development,10,1,Life Sciences,1,Female,...,3,5,1,4,3.0,2.0,4.0,2,4,"7,316"
2,3,32,No,Travel_Frequently,Research & Development,17,4,Other,1,Male,...,2,5,0,3,2.0,2.0,1.0,3,3,"6,8161"
3,4,38,No,Non-Travel,Research & Development,2,5,Life Sciences,1,Male,...,5,8,7,5,4.0,4.0,3.0,2,3,"6,7892"
4,5,32,No,Travel_Rarely,Research & Development,10,1,Medical,1,Male,...,2,6,0,4,4.0,1.0,3.0,3,3,"7,8776"

# 4. Asignar y revisar categorías

## 4.1. Asignar categorías

In [44]:
education = {
    1 : "Por debajo de la universidad",
    2 : "Universitario",
    3 : "Licenciado",
    4 : "Máster",
    5 : "Doctor"
}
environment_satisfaction = job_satisfaction = job_involvement = {
    1: 'Bajo',
    2: 'Medio',
    3: 'Alto',
    4: 'Muy alto'
}
performance_rating = {
    1: 'Bajo',
    2: 'Bueno',
    3: 'Excelente',
    4: 'Sobresaliente'
}
work_life_balance = {
    1: 'Mala',
    2: 'Buena',
    3: 'Muy buena',
    4: 'La mejor'
}
over18 = {
    'Y':'Sí',
    'N':'No'
}

In [45]:
df_employees.education = df_employees.education.replace(education)
df_employees.environment_satisfaction = df_employees.environment_satisfaction.replace(environment_satisfaction)
df_employees.job_satisfaction = df_employees.job_satisfaction.replace(job_satisfaction)
df_employees.performance_rating = df_employees.performance_rating.replace(performance_rating)
df_employees.job_involvement = df_employees.job_involvement.replace(job_involvement)
df_employees.work_life_balance = df_employees.work_life_balance.replace(work_life_balance)
df_employees.over18 = df_employees.over18.replace(over18)

## 4.2. Transformar variables cuantitativas discretas que se tratarán como variables categóricas.

In [46]:
df_employees.job_level.value_counts()

job_level
1    1629
2    1602
3     654
4     318
5     207
Name: count, dtype: int64

In [47]:
df_employees.stock_option_level.value_counts()

stock_option_level
0    1893
1    1788
2     474
3     255
Name: count, dtype: int64

In [48]:
df_employees.training_times_last_year.value_counts()

training_times_last_year
2    1641
3    1473
4     369
5     357
1     213
6     195
0     162
Name: count, dtype: int64

In [49]:
df_employees.job_level = df_employees.job_level.astype(str)
df_employees.stock_option_level = df_employees.stock_option_level.astype(str)
df_employees.training_times_last_year = df_employees.training_times_last_year.astype(str)

La columna mean_time tiene formato 'object' debido a que los valores están separados por ','.

In [50]:
#Reemplazar ',' por '.' y convertir columna a float
df_employees.mean_time = df_employees.mean_time.str.replace(',', '.').astype(float)

## 4.3. Revisar y validar categorías

Seleccionar variables que no son numéricas.

In [51]:
#Obtener variables categóricas
category_columns = df_employees.select_dtypes(exclude=['number'])

Revisar que no hayan categorías extrañas.

In [52]:
for col in category_columns:
    df = df_employees.groupby([col], dropna=False)[['employee_id']].count().rename(columns={'employee_id':'count'}).reset_index()
    display(df.style.set_properties(**{'text-align': 'center'}))
    print('\n----------------------------------')

----------------------------------

----------------------------------

----------------------------------

----------------------------------

----------------------------------

----------------------------------

----------------------------------

----------------------------------

----------------------------------

----------------------------------

----------------------------------

----------------------------------

----------------------------------

----------------------------------

----------------------------------

----------------------------------

----------------------------------

Corregir la categoría 'Non-Travel' en la variable 'business_travel'.

In [54]:
df_employees.business_travel = df_employees.business_travel.replace({'Non-Travel':'Non_Travel'})
df_employees.business_travel.unique()

array(['Travel_Rarely', 'Travel_Frequently', 'Non_Travel'], dtype=object)

# 5. Tratar valores faltantes

## 5.1. Ver valores faltantes

In [55]:
df_nulos = df_employees.isnull().sum()
df_nulos[df_nulos!=0]

num_companies_worked        19
total_working_years          9
environment_satisfaction    25
job_satisfaction            20
work_life_balance           38
dtype: int64

In [56]:
df_employees2 = df_employees.copy()

## 5.2. Tratar valores faltantes de columnas categóricas

Reemplazas nulos por la moda.

In [57]:
from sklearn.impute import SimpleImputer

imp_cat = SimpleImputer(strategy='most_frequent')
df_cat = df_employees2[['environment_satisfaction', 'job_satisfaction', 'work_life_balance']]
imp_cat.fit(df_cat)
df_employees2[['environment_satisfaction', 'job_satisfaction', 'work_life_balance']] = imp_cat.fit_transform(df_cat.values)

## 5.3. Tratar valores faltantes de columnas numéricas

Reemplaza nulos en 'num_companied_worked' por la mediana.

In [58]:
imp_num = SimpleImputer(strategy='median')
imp_num.fit(df_employees2[['num_companies_worked']])
df_employees2[['num_companies_worked']] = imp_num.transform(df_employees2[['num_companies_worked']])

Eliminar registros con valores faltantes en la columna 'total_working_years'

In [59]:
df_employees2.dropna(inplace=True)

In [60]:
df_nulos2 = df_employees2.isnull().sum()
df_nulos2[df_nulos2!=0]

Series([], dtype: int64)

# 6. Revisar valores duplicados

In [61]:
df_employees2[df_employees2.duplicated()]

Empty DataFrame
Columns: [employee_id, age, attrition, business_travel, department, distance_from_home, education, education_field, employee_count, gender, job_level, job_role, marital_status, monthly_income, num_companies_worked, over18, percent_salary_hike, standard_hours, stock_option_level, total_working_years, training_times_last_year, years_at_company, years_since_last_promotion, years_with_curr_manager, environment_satisfaction, job_satisfaction, work_life_balance, job_involvement, performance_rating, mean_time]
Index: []

[0 rows x 30 columns]

# 7. Eliminar columnas constantes

Detectar columnas constantes.

In [62]:
for col in df_employees2:
    if df_employees2[col].unique().shape[0] == 1:
        print(col)

employee_count
over18
standard_hours

Eliminar esas columnas constantes.

In [63]:
df_employees_final = df_employees2.drop(['employee_count', 'over18', 'standard_hours'], axis=1)

# 8. Exportar dataframe limpio en formato csv

In [64]:
pd.set_option('display.max_columns', None)

In [65]:
df_employees_final.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4401 entries, 0 to 4408
Data columns (total 27 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   employee_id                 4401 non-null   int64
 1   age                         4401 non-null   int64
 2   attrition                   4401 non-null   object
 3   business_travel             4401 non-null   object
 4   department                  4401 non-null   object
 5   distance_from_home          4401 non-null   int64
 6   education                   4401 non-null   object
 7   education_field             4401 non-null   object
 8   gender                      4401 non-null   object
 9   job_level                   4401 non-null   object
 10  job_role                    4401 non-null   object
 11  marital_status              4401 non-null   object
 12  monthly_income              4401 non-null   int64
 13  num_companies_worked        4401 non-null   float64
 14  percent_salary_hike         4401 non-null   int64
 15  stock_option_level          4401 non-null   object
 16  total_working_years         4401 non-null   float64
 17  training_times_last_year    4401 non-null   object
 18  years_at_company            4401 non-null   int64
 19  years_since_last_promotion  4401 non-null   int64
 20  years_with_curr_manager     4401 non-null   int64
 21  environment_satisfaction    4401 non-null   object
 22  job_satisfaction            4401 non-null   object
 23  work_life_balance           4401 non-null   object
 24  job_involvement             4401 non-null   object
 25  performance_rating          4401 non-null   object
 26  mean_time                   4401 non-null   float64
dtypes: float64(3), int64(8), object(16)
memory usage: 962.7+ KB

In [66]:
df_employees_final.to_csv('Datasets/datos_limpios.csv', quotechar='"', index=False)